# 예제1-16
* 특정 열 행 인덱스로 설정

In [3]:
import pandas as pd

In [46]:
exam_data = {'이름' : [ '서준', '우현', '인아'],
             '수학' : [ 90, 80, 70],
             '영어' : [ 98, 89, 95],
             '음악' : [ 85, 95, 100],
             '체육' : [ 100, 90, 90]}
df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [47]:
ndf = df.set_index(['이름'])
ndf

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [48]:
ndf2 = ndf.set_index('음악',append=True)
ndf2

        수학  영어   체육
이름 음악
서준 85   90  98  100
우현 95   80  89   90
인아 100  70  95   90

In [49]:
ndf3 = ndf.set_index(['수학', '음악'])
ndf3

        영어   체육
수학 음악
90 85   98  100
80 95   89   90
70 100  95   90

In [50]:
df3 = df.set_index(['이름'],drop=False)
df3

    이름  수학  영어   음악   체육
이름
서준  서준  90  98   85  100
우현  우현  80  89   95   90
인아  인아  70  95  100   90

In [8]:
df2 = df.copy()
df2.set_index(['이름'],inplace = True)
df2

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [13]:
df4 = df.set_index(['수학'],append = False)
df4

    이름  영어   음악   체육
수학
90  서준  98   85  100
80  우현  89   95   90
70  인아  95  100   90

# 예제 1-17
* 행 인덱스 재배열

In [51]:
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}

df = pd.DataFrame(dict_data, index=['r0', 'r1', 'r2'])
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [17]:
new_index = ['r0', 'r1', 'r2', 'r3', 'r4']
ndf = df.reindex(new_index)
ndf

     c0   c1   c2    c3    c4
r0  1.0  4.0  7.0  10.0  13.0
r1  2.0  5.0  8.0  11.0  14.0
r2  3.0  6.0  9.0  12.0  15.0
r3  NaN  NaN  NaN   NaN   NaN
r4  NaN  NaN  NaN   NaN   NaN

In [18]:
ndf2 = df.reindex(new_index, fill_value=0)
ndf2

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15
r3   0   0   0   0   0
r4   0   0   0   0   0

In [15]:
df.reindex(new_index, fill_value='missing')

         c0       c1       c2       c3       c4
r0        1        4        7       10       13
r1        2        5        8       11       14
r2        3        6        9       12       15
r3  missing  missing  missing  missing  missing
r4  missing  missing  missing  missing  missing

In [19]:
df.reindex(columns = ['c0','c2','c6'])

    c0  c2  c6
r0   1   7 NaN
r1   2   8 NaN
r2   3   9 NaN

In [20]:
df.reindex(['c0','c2','c6'], axis ='columns')

    c0  c2  c6
r0   1   7 NaN
r1   2   8 NaN
r2   3   9 NaN

In [19]:
df.reindex(['r0','r0-2','r2','r4'], method='ffill')

      c0  c1  c2  c3  c4
r0     1   4   7  10  13
r0-2   1   4   7  10  13
r2     3   6   9  12  15
r4     3   6   9  12  15

In [20]:
df.reindex(['r0','r0-2','r2','r4'], method='bfill')

       c0   c1   c2    c3    c4
r0    1.0  4.0  7.0  10.0  13.0
r0-2  2.0  5.0  8.0  11.0  14.0
r2    3.0  6.0  9.0  12.0  15.0
r4    NaN  NaN  NaN   NaN   NaN

In [22]:
df.reindex(['r0','r0-2','r0-3','r1','r1-1','r2'], method='bfill')

      c0  c1  c2  c3  c4
r0     1   4   7  10  13
r0-2   2   5   8  11  14
r0-3   2   5   8  11  14
r1     2   5   8  11  14
r1-1   3   6   9  12  15
r2     3   6   9  12  15

In [21]:
df.reindex(['r0','r0-2','r0-3','r1','r1-1','r2'], method='ffill')

      c0  c1  c2  c3  c4
r0     1   4   7  10  13
r0-2   1   4   7  10  13
r0-3   1   4   7  10  13
r1     2   5   8  11  14
r1-1   2   5   8  11  14
r2     3   6   9  12  15

In [23]:
df.reindex(['r0','r0-2','r0-3','r1','r1-1','r2'], method='bfill',limit=1)

       c0   c1   c2    c3    c4
r0    1.0  4.0  7.0  10.0  13.0
r0-2  NaN  NaN  NaN   NaN   NaN
r0-3  2.0  5.0  8.0  11.0  14.0
r1    2.0  5.0  8.0  11.0  14.0
r1-1  3.0  6.0  9.0  12.0  15.0
r2    3.0  6.0  9.0  12.0  15.0

In [22]:
df.reindex(['r0','r0-2','r0-3','r1','r1-1','r2'], method='ffill',limit=1)

       c0   c1   c2    c3    c4
r0    1.0  4.0  7.0  10.0  13.0
r0-2  1.0  4.0  7.0  10.0  13.0
r0-3  NaN  NaN  NaN   NaN   NaN
r1    2.0  5.0  8.0  11.0  14.0
r1-1  2.0  5.0  8.0  11.0  14.0
r2    3.0  6.0  9.0  12.0  15.0

In [52]:
df.reindex(['c0','c0-2','c1'],axis = 1, method='bfill')

    c0  c0-2  c1
r0   1     4   4
r1   2     5   5
r2   3     6   6

In [27]:
df.reindex(columns = ['c0','c0-2','c1'],method='ffill')

    c0  c0-2  c1
r0   1     1   4
r1   2     2   5
r2   3     3   6

In [28]:
df.reindex(columns = ['c0','c0-2','c3'],method='bfill')

    c0  c0-2  c3
r0   1     4  10
r1   2     5  11
r2   3     6  12

# 예제 1-18
* 행 인덱스 초기화

In [23]:
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}

df = pd.DataFrame(dict_data, index=['r0', 'r1', 'r2'])
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [24]:
df.reset_index()

  index  c0  c1  c2  c3  c4
0    r0   1   4   7  10  13
1    r1   2   5   8  11  14
2    r2   3   6   9  12  15

In [25]:
df.reset_index(drop = True)

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [26]:
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [29]:
ndf = df.set_index(['c0','c1'], append = True)
ndf

          c2  c3  c4
   c0 c1
r0 1  4    7  10  13
r1 2  5    8  11  14
r2 3  6    9  12  15

In [28]:
ndf = df.set_index(['c0','c1'], append = False)
ndf

       c2  c3  c4
c0 c1
1  4    7  10  13
2  5    8  11  14
3  6    9  12  15

In [30]:
ndf.reset_index(1)# Level 1 제거

       c0  c2  c3  c4
   c1
r0 4    1   7  10  13
r1 5    2   8  11  14
r2 6    3   9  12  15

In [32]:
ndf.reset_index(1,drop=True)

       c2  c3  c4
   c1
r0 4    7  10  13
r1 5    8  11  14
r2 6    9  12  15

In [40]:
ndf.reset_index('c0')

       c0  c2  c3  c4
   c1
r0 4    1   7  10  13
r1 5    2   8  11  14
r2 6    3   9  12  15

In [41]:
ndf.reset_index(['c0','c1'],drop=True)

    c2  c3  c4
r0   7  10  13
r1   8  11  14
r2   9  12  15

In [42]:
ndf.reset_index()

  level_0  c0  c1  c2  c3  c4
0      r0   1   4   7  10  13
1      r1   2   5   8  11  14
2      r2   3   6   9  12  15

# 예제 1-19
* 행 인덱스를 기준으로 데이터 프레임 정렬

In [33]:
dict_data = {'c1':[1,2,3], 'c0':[4,5,6], 'c2':[7,8,9], 'c4':[10,11,12], 'c3':[13,14,15]}

df = pd.DataFrame(dict_data, index=['r1', 'r0', 'r2'])
df

    c1  c0  c2  c4  c3
r1   1   4   7  10  13
r0   2   5   8  11  14
r2   3   6   9  12  15

In [34]:
df.sort_index()

    c1  c0  c2  c4  c3
r0   2   5   8  11  14
r1   1   4   7  10  13
r2   3   6   9  12  15

In [35]:
df.sort_index(ascending=False)

    c1  c0  c2  c4  c3
r2   3   6   9  12  15
r1   1   4   7  10  13
r0   2   5   8  11  14

In [36]:
df.sort_index(axis = 1)

    c0  c1  c2  c3  c4
r1   4   1   7  13  10
r0   5   2   8  14  11
r2   6   3   9  15  12

In [37]:
df.sort_index(axis = 1,ascending=False)

    c4  c3  c2  c1  c0
r1  10  13   7   1   4
r0  11  14   8   2   5
r2  12  15   9   3   6

In [38]:
df

    c1  c0  c2  c4  c3
r1   1   4   7  10  13
r0   2   5   8  11  14
r2   3   6   9  12  15

In [39]:
ndf2 = df.copy()
ndf2.loc['r1','c1'] = 2

ndf2.set_index(['c1','c0'],append = True, inplace = True)
ndf2

          c2  c4  c3
   c1 c0
r1 2  4    7  10  13
r0 2  5    8  11  14
r2 3  6    9  12  15

In [40]:
ndf2.sort_index()

          c2  c4  c3
   c1 c0
r0 2  5    8  11  14
r1 2  4    7  10  13
r2 3  6    9  12  15

In [41]:
ndf2.sort_index(level=[1,2],ascending=[False,False])

          c2  c4  c3
   c1 c0
r2 3  6    9  12  15
r0 2  5    8  11  14
r1 2  4    7  10  13

# 예제1-20
* 특정 열의 데이터값을 기준으로 데이터프레임 정렬

In [57]:
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}

df = pd.DataFrame(dict_data, index=['r0', 'r1', 'r2'])
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [43]:
df.sort_values(by='c1', ascending=False)

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

In [58]:
ndf2 = df.copy()
ndf2.iloc[0,0] = 2
ndf2

    c0  c1  c2  c3  c4
r0   2   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [61]:
ndf2.sort_values(by='r1', axis = 1, ascending=False)

    c4  c3  c2  c1  c0
r0  13  10   7   4   2
r1  14  11   8   5   2
r2  15  12   9   6   3

In [67]:
ndf2.sort_values(by=['c0','c1'], ascending=[True, False])

    c0  c1  c2  c3  c4
r1   2   5   8  11  14
r0   2   4   7  10  13
r2   3   6   9  12  15

# 예제 1-21

In [68]:
student1 = pd.Series({'국어':100, '영어':80, '수학':90})
student1

국어    100
영어     80
수학     90
dtype: int64

In [69]:
percentage = student1 / 200
percentage

국어    0.50
영어    0.40
수학    0.45
dtype: float64

In [70]:
type(percentage)

pandas.core.series.Series

In [71]:
grade= student1*0.5
print(type(grade))
print(grade)

<class 'pandas.core.series.Series'>
국어    50.0
영어    40.0
수학    45.0
dtype: float64

# 예제 1-22
* 시리즈 연산

In [72]:
student1 = pd.Series({'국어':100, '영어':80, '수학':90})
student2 = pd.Series({'수학':80, '국어':90, '영어':80})

In [73]:
student1

국어    100
영어     80
수학     90
dtype: int64

In [74]:
student2

수학    80
국어    90
영어    80
dtype: int64

In [75]:
addition = student1 + student2               #덧셈
subtraction = student1 - student2            #뺄셈
multiplication = student1 * student2         #곱셈
division = student1 / student2               #나눗셈

In [76]:
result = pd.DataFrame([addition, subtraction, multiplication, division], 
                      index=['덧셈', '뺄셈', '곱셈', '나눗셈'])
result

              국어        수학      영어
덧셈    190.000000   170.000   160.0
뺄셈     10.000000    10.000     0.0
곱셈   9000.000000  7200.000  6400.0
나눗셈     1.111111     1.125     1.0

# 예제 1-23

In [77]:
import numpy as np

student1 = pd.Series({'국어':np.nan, '영어':80, '수학':90})
student2 = pd.Series({'수학':80, '국어':90})

In [78]:
student1

국어     NaN
영어    80.0
수학    90.0
dtype: float64

In [79]:
student2

수학    80
국어    90
dtype: int64

In [80]:
addition = student1 + student2               #덧셈
subtraction = student1 - student2            #뺄셈
multiplication = student1 * student2         #곱셈
division = student1 / student2               #나눗셈

In [81]:
result = pd.DataFrame([addition, subtraction, multiplication, division], 
                      index=['덧셈', '뺄셈', '곱셈', '나눗셈'])
result

     국어        수학  영어
덧셈  NaN   170.000 NaN
뺄셈  NaN    10.000 NaN
곱셈  NaN  7200.000 NaN
나눗셈 NaN     1.125 NaN

# 예제 1-24

In [82]:
student1 = pd.Series({'국어':np.nan, '영어':80, '수학':90})
student2 = pd.Series({'수학':80, '국어':90})

In [83]:
student1

국어     NaN
영어    80.0
수학    90.0
dtype: float64

In [84]:
student2

수학    80
국어    90
dtype: int64

In [85]:
student1.add(100, fill_value=0)

국어    100.0
영어    180.0
수학    190.0
dtype: float64

In [86]:
student1.add(student2, fill_value=0)

국어     90.0
수학    170.0
영어     80.0
dtype: float64

In [87]:
student1.sub(student2, fill_value=0)

국어   -90.0
수학    10.0
영어    80.0
dtype: float64

In [88]:
student1.mul(student2, fill_value=0)

국어       0.0
수학    7200.0
영어       0.0
dtype: float64

In [89]:
student1.div(student2, fill_value=0)

국어    0.000
수학    1.125
영어      inf
dtype: float64

In [90]:
student1.div(student2, fill_value=1)

국어     0.011111
수학     1.125000
영어    80.000000
dtype: float64

# 예제 1-25

In [91]:
import seaborn as sns

In [92]:
titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age','fare']]
df.head()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [93]:
addition = df + 10
addition.head()

    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500

In [94]:
type(addition)

pandas.core.frame.DataFrame

# 예제 1-26

In [95]:
titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age','fare']]
df.tail()

      age   fare
886  27.0  13.00
887  19.0  30.00
888   NaN  23.45
889  26.0  30.00
890  32.0   7.75

In [96]:
addition = df + 10
addition.tail()

      age   fare
886  37.0  23.00
887  29.0  40.00
888   NaN  33.45
889  36.0  40.00
890  42.0  17.75

In [98]:
subtraction = addition - df
subtraction.tail()

      age  fare
886  10.0  10.0
887  10.0  10.0
888   NaN  10.0
889  10.0  10.0
890  10.0  10.0

In [99]:
type(subtraction)

pandas.core.frame.DataFrame

In [101]:
titanic = sns.load_dataset('titanic')
df = titanic.loc[:4, ['age','fare']]
df

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [102]:
df.add(1)

    age     fare
0  23.0   8.2500
1  39.0  72.2833
2  27.0   8.9250
3  36.0  54.1000
4  36.0   9.0500

In [104]:
df - [1,2]

    age     fare
0  21.0   5.2500
1  37.0  69.2833
2  25.0   5.9250
3  34.0  51.1000
4  34.0   6.0500

In [105]:
df.sub([1,2])

    age     fare
0  21.0   5.2500
1  37.0  69.2833
2  25.0   5.9250
3  34.0  51.1000
4  34.0   6.0500

In [106]:
ndf2 = df.sub([10,20,30,40,50], axis='index')
ndf2

    age     fare
0  12.0  -2.7500
1  18.0  51.2833
2  -4.0 -22.0750
3  -5.0  13.1000
4 -15.0 -41.9500

In [107]:
df.sub(ndf2)

    age  fare
0  10.0  10.0
1  20.0  20.0
2  30.0  30.0
3  40.0  40.0
4  50.0  50.0